// 主题独有配置
import { getThemeConfig } from '@sugarat/theme/node'
import { footerHTML } from '@sugarat/theme/node'

// 开启RSS支持（RSS配置）
import type { Theme } from '@sugarat/theme'

const svgIconfriend = '<svg t="1758029298883" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="23537" width="32" height="32"><path d="M512 186.181818c-94.254545 0-170.666667 76.427636-170.666667 170.666667 0 94.254545 76.412121 170.666667 170.666667 170.666667s170.666667-76.412121 170.666667-170.666667c0-94.23903-76.412121-170.666667-170.666667-170.666667" fill="#444444" p-id="23538"></path><path d="M398.165333 484.010667c-7.912727-7.090424-15.158303-14.863515-21.628121-23.319273a67.072 67.072 0 0 1-59.578182 36.352 67.149576 67.149576 0 0 1-67.056485-67.056485 67.149576 67.149576 0 0 1 91.803152-62.324364A170.821818 170.821818 0 0 1 341.333333 356.848485c0-7.090424 0.465455-14.087758 1.303273-20.945455a97.512727 97.512727 0 0 0-123.190303 94.099394c-0.015515 33.82303 17.206303 63.612121 43.333818 81.144243C208.833939 540.392727 170.666667 612.072727 170.666667 695.885576h30.471757c0-23.769212 3.428848-46.778182 10.131394-68.344243 6.330182-20.417939 15.39103-38.710303 26.825697-54.178909 21.721212-29.556364 49.757091-45.862788 78.863515-45.862788 17.749333 0 35.033212 6.019879 50.734546 17.37697 7.323152-7.540364 14.941091-14.475636 22.853818-20.883394-6.237091-4.964848-12.722424-9.293576-19.502546-12.955151a96.550788 96.550788 0 0 0 27.120485-27.042909zM317.564121 843.713939c-0.465455-7.850667-0.620606-15.701333-0.620606-23.629575 0-41.285818 5.725091-81.221818 17.066667-118.784 10.752-35.498667 25.987879-67.273697 45.257697-94.239031C415.930182 555.783758 463.080727 527.515152 512 527.515152c48.919273 0 96.085333 28.268606 132.716606 79.546181 19.285333 26.965333 34.521212 58.740364 45.273212 94.239031 11.341576 37.562182 17.066667 77.498182 17.066667 118.784 0 7.928242-0.232727 15.778909-0.620606 23.629575h48.841697c0.387879-7.773091 0.620606-15.701333 0.620606-23.629575 0-188.493576-109.195636-341.333333-243.820606-341.333334s-243.898182 152.839758-243.898182 341.333334c0 7.928242 0.232727 15.856485 0.620606 23.629575h48.764121z" fill="#444444" p-id="23539"></path><path d="M633.37503 524.086303c7.912727 6.407758 15.546182 13.34303 22.853818 20.883394 15.778909-11.434667 33.078303-17.454545 50.827637-17.454545 29.106424 0 57.142303 16.306424 78.848 45.800727 11.434667 15.530667 20.417939 33.745455 26.825697 54.147879 6.702545 21.566061 10.131394 44.590545 10.131394 68.359757h30.471757c0-83.812848-38.167273-155.508364-92.113454-184.769939a97.528242 97.528242 0 0 0 43.364848-81.144243A97.512727 97.512727 0 0 0 681.363394 335.84097c0.837818 6.857697 1.287758 13.85503 1.287758 20.945454 0 3.661576-0.155152 7.245576-0.372364 10.814061a67.149576 67.149576 0 0 1 91.803151 62.324363 67.149576 67.149576 0 0 1-67.040969 67.056485 67.087515 67.087515 0 0 1-59.578182-36.336485A169.177212 169.177212 0 0 1 625.819152 483.933091a97.807515 97.807515 0 0 0 27.042909 27.198061 133.383758 133.383758 0 0 0-19.502546 12.955151z" fill="#444444" p-id="23540"></path><path d="M598.171152 270.677333A120.847515 120.847515 0 0 1 633.902545 356.848485c0 32.535273-12.644848 63.162182-35.731393 86.171151A120.847515 120.847515 0 0 1 512 478.75103a120.847515 120.847515 0 0 1-86.171152-35.731394A121.297455 121.297455 0 0 1 390.097455 356.848485c0-32.535273 12.644848-63.146667 35.731393-86.171152A121.297455 121.297455 0 0 1 512 234.945939c32.535273 0 63.146667 12.644848 86.171152 35.731394z" fill="#F8D02D" p-id="23541"></path></svg>'

const svgIconStr = '<svg t="1758026903773" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="19351" width="24" height="24"><path d="M0 0h1024v1024H0z" fill="#FFFFFF" p-id="19352"></path><path d="M324.88448 106.7008a81.92 81.92 0 0 1 59.392-40.1408l201.33888-28.68224a81.92 81.92 0 0 1 87.56224 50.55488l75.8272 188.70272a81.92 81.92 0 0 1-5.0688 71.50592L439.54176 875.8784a81.92 81.92 0 0 1-111.90272 29.98272L50.46272 745.84064A81.92 81.92 0 0 1 20.48 633.93792L324.88448 106.7008z" fill="#E36130" p-id="19353"></path><path d="M317.44 251.11552a81.92 81.92 0 0 1 34.22208-66.60096l209.92-150.35392a81.92 81.92 0 0 1 95.39584 0l209.92 150.35392A81.92 81.92 0 0 1 901.12 251.11552V931.84a81.92 81.92 0 0 1-81.92 81.92H399.36a81.92 81.92 0 0 1-81.92-81.92V251.11552z" fill="#FF7744" p-id="19354"></path><path d="M614.4 235.52m-71.68 0a71.68 71.68 0 1 0 143.36 0 71.68 71.68 0 1 0-143.36 0Z" fill="#E36130" p-id="19355"></path><path d="M705.7408 174.7968a189.32736 189.32736 0 0 1 166.44096-99.19488h5.3248c13.1584 0 25.94816 4.27008 36.46464 12.17536 33.536 25.1904 32.13312 76.04224-2.75456 99.328l-3.65568 2.4576a74.38336 74.38336 0 0 1 28.2624 58.368v1.30048l11.59168-7.74144c72.33536-48.30208 75.25376-153.7536 5.70368-206.00832A125.8496 125.8496 0 0 0 877.5168 10.24h-5.33504A254.55616 254.55616 0 0 0 648.3968 143.616l-40.28416 74.3424a32.70656 32.70656 0 0 0 13.1072 44.31872c15.83104 8.6016 35.6352 2.73408 44.2368-13.12768l40.28416-74.3424z" fill="#FFA17E" p-id="19356"></path><path d="M614.4 440.32l50.31936 125.30688 134.71744 9.13408-103.6288 86.56896 32.95232 130.94912L614.4 720.4864l-114.36032 71.79264 32.94208-130.94912-103.6288-86.56896 134.72768-9.13408z" fill="#FFA17E" p-id="19357"></path></svg>'
const baseUrl = 'https://boke.20050815.xyz'
const RSS: Theme.RSSOptions = {
  title: '克喵爱吃卤面',
  baseUrl,
  copyright: 'Copyright (c) 2025-present, 粥里有勺糖',
  description: '克喵在这里记录我的生活记录、生活记录和踩坑教程。',
  language: 'zh-cn',
  image: 'https://www.gravatar.com/avatar/7614b285e795f21e780247019c4e15c4?s=256',
  favicon: 'https://img.314926.xyz/images/2025/08/13/no-background-kemiaofxjun.webp',
}

// 所有配置项，详见文档: https://theme.sugarat.top/
const blogTheme = getThemeConfig({
  // 开启RSS支持
  RSS,

  // 搜索
  // 默认开启pagefind离线的全文搜索支持（如使用其它的可以设置为false）
  // search: true,

  // 默认开启 markdown 图表支持（会增加一定的构建耗时）
  // mermaid: false

  // 页脚
  footer: {
    // message 字段支持配置为HTML内容，配置多条可以配置为数组
    // message: '下面 的内容和图标都是可以修改的噢（当然本条内容也是可以隐藏的）',
    copyright: 'MIT License | 克喵爱吃卤面',

    version: {
      name: 'theme',
      // icon: '',
      // link: ''
    },
    // icpRecord: {
    //   name: '蜀ICP备19011724号',
    //   link: 'https://beian.miit.gov.cn/'
    // },
    // securityRecord: {
    //   name: '公网安备xxxxx',
    //   link: 'https://www.beian.gov.cn/portal/index.do'
    // },
    message: footerHTML([
      {
        text: '茶ICP备2025090150号',
        link: 'https://icp.redcha.cn/beian/ICP-2025090150.html',
        icon: ''
      },
      ]),
  },

  home: {
    name: '喵洛阁',
    motto: '愿你看清一切真相后，依旧热爱你的家人和朋友。',
    // inspiring: '3000',
    pageSize: 6,
    analysis: {
      articles: {
        title: ['博客文章', '月更新', '周更新']
      }
    },
    blogInfoCollapsible: true
  },

  homeTags: {
    title: `${svgIconStr} 标签`
  },  

  // 主题色修改
  themeColor: 'vp-yellow',

  // 文章默认作者
  author: '克喵爱吃卤面',

  comment: {
    type: 'giscus',
    options: {
      repo: 'kemiaofxjun/giscus-comments',
      repoId: 'R_kgDOPbFKpQ',
      category: 'sugar-blog',
      categoryId: 'DIC_kwDOPbFKpc4CvgsW',
      inputPosition: 'top'
    },
    // 自定义展示内容
    label: '发表意见',
    icon: `<svg t="1758028847253" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="21348" width="24" height="24"><path d="M641.536 512m-228.394667 0a228.394667 228.394667 0 1 0 456.789334 0 228.394667 228.394667 0 1 0-456.789334 0Z" fill="#F9EF00" p-id="21349"></path><path d="M489.386667 170.666667a320.256 320.256 0 0 0-320 320v278.613333c0 46.72 37.973333 84.906667 85.333333 84.906667h278.186667c176.512 0 320-143.445333 320-320V490.666667c0-176.554667-143.488-320-320-320h-43.52z m-405.333334 320c0-223.658667 181.632-405.333333 405.333334-405.333334h43.52c223.658667 0 405.333333 181.674667 405.333333 405.333334v43.52c0 223.658667-181.674667 405.333333-405.333333 405.333333H254.72c-94.293333 0-170.666667-76.16-170.666667-170.24V490.666667z m206.08-35.413334a42.666667 42.666667 0 0 1 42.666667-42.666666h353.28a42.666667 42.666667 0 1 1 0 85.333333H332.8a42.666667 42.666667 0 0 1-42.666667-42.666667z m40.96 133.973334a42.666667 42.666667 0 1 0 0 85.333333h235.946667a42.666667 42.666667 0 0 0 0-85.333333H331.093333z" fill="#000000" p-id="21350"></path></svg>`,
    mobileMinify: false
  },

  article: {
    /**
     * 是否展示文章的预计阅读时间
     */
    readingTime: true,
    /**
     * 是否隐藏文章页的封面展示
     */
    hiddenCover: false,
    /**
     * 阅读时间分析展示位置
     */
    readingTimePosition: 'inline',
    /**
     * 自定义一系列文案标题
     */
    // analyzeTitles: {
    //   inlineWordCount: '{{value}} word counts',
    //   inlineReadTime: '{{value}} min read time',
    //   wordCount: 'Total word count',
    //   readTime: 'Total read time',
    //   author: 'Author',
    //   publishDate: 'Published on',
    //   lastUpdated: 'Last updated on',
    //   tag: 'Tags',
    // }
  },

  // 友链
  friend: {
    title: `${svgIconfriend} 友链`,
    list: [
      {
        nickname: '粥里有勺糖',
        des: '你的指尖用于改变世界的力量',
        avatar:
          'https://img.cdn.sugarat.top/mdImg/MTY3NDk5NTE2NzAzMA==674995167030',
        url: 'https://sugarat.top',
      },
      {
        nickname: 'Vitepress',
        des: 'Vite & Vue Powered Static Site Generator',
        avatar:
          'https://vitepress.dev/vitepress-logo-large.webp',
        url: 'https://vitepress.dev/',
      },
    ],
    random: true,
    // 限制列表只展示 3 个
    limit: 3,
    // 自定义滚动速度（可选）
    scrollSpeed: 10000
  },

  buttonAfterArticle: {
    openTitle: '赞赏',
    closeTitle: '下次一定',
    content: '<img src="https://img.314926.xyz/images/2025/07/12/alipay.webp">',
    icon: 'aliPay'
  },

  // 公告
  popover: {
    mobileMinify: true,
    title: '公告',
    body: [
      { type: 'text', content: '欢迎来到克喵的博客！' },
      { type: 'text', content: '在这里记录我的生活记录、生活记录和踩坑教程。' },
      { type: 'text', content: '希望你能喜欢这里的内容😊' },
      { type: 'text', content: '如果网站有什么问题，优先<kbd>CTRL</kbd>+<kbd>F5</kbd>刷新一下~' },
      { type: 'text', content: '如果有什么问题或建议，优先<strong><a href="mailto:me@mail.kemeow.top" target="_blank">邮箱</a></strong>联系我~' },
      // {
      //   type: 'image',
      //   src: 'https://img.cdn.sugarat.top/mdImg/MTYxNTAxODc2NTIxMA==615018765210~fmt.webp'
      // },
      // {
      //   type: 'text',
      //   content: '欢迎大家加群&私信交流'
      // },
      // {
      //   type: 'text',
      //   content: '文章首/文尾有群二维码',
      //   style: 'padding-top:0'
      // },
      // {
      //   type: 'button',
      //   content: '作者博客',
      //   link: 'https://sugarat.top'
      // },
      // {
      //   type: 'button',
      //   content: '加群交流',
      //   props: {
      //     type: 'success'
      //   },
      //   link: 'https://theme.sugarat.top/group.html',
      // }
    ],
    duration: 10
  },

  oml2d: {
    mobileDisplay: true,
    models: [
      {
        path: 'https://registry.npmmirror.com/oml2d-models/latest/files/models/Senko_Normals/senko.model3.json'
      }
    ]
  },

  // 任务列表  
  taskCheckbox: false,

  authorList: [
    {
      nickname: '克喵爱吃卤面',
      url: 'https://boke.20050815.xyz/about.html',
      des: '愿你看清一切真相后，依旧热爱你的家人和朋友。',
    }
  ]
})

export { blogTheme }
